{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Remember",
    "1": "Understand",
    "2": "Apply",
    "3": "Analyse",
    "4": "Evaluate",
    "5": "Create"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Analyse": 3,
    "Apply": 2,
    "Create": 5,
    "Evaluate": 4,
    "Remember": 0,
    "Understand": 1
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.1.0",
  "use_cache": false,
  "vocab_size": 30522
}
